Revit 2026 API

# EntityClear(Field) Method

---

Resets the field to its default value.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Clear(
	Field field
)
```
```vb
Public Sub Clear (
	field As Field
)
```
```cpp
public:
void Clear(
	Field^ field
)
```
```fsharp
member Clear :
        field : Field -> unit
```

#### Parameters

field Field
     The field to clear.

| Exception | Condition |
| --- | --- |
| ArgumentException | The Field belongs to a different Schema from this Entity, or this Entity is invalid. -or- This field's subschema prevents writing. |
| ArgumentNullException | A non-optional argument was null |

The default value is zero for numeric fields, invalid value for identifiers and entities, and empty for strings and containers.

#### Reference

Entity Class

Clear Overload

Autodesk.Revit.DB.ExtensibleStorage Namespace